// 26311044_Byungho_self-introduction.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <stdio.h>

int main(void)
{
	const char 이름[] = "임병호";
	char 재학중인학교[] = "한국it직업전문학교";

	printf("---------------------------------------------------------------------------------------------\n");
	printf("자기소개서\n");
	printf("---------------------------------------------------------------------------------------------\n");

	printf("안녕하세요. 제 이름은 %s입니다.\n", 이름);
	printf("저는 %s에 다니며 게임 프로그래밍을 배우고 있습니다.\n", 재학중인학교);
	printf("저는 게임 개발에 관심이 많아서 공부를 시작하게 되었습니다.\n");
	printf("아직은 베이스도 없고 처음이라 아는것 도 없지만 열심히 해서 금방 실력을 늘릴 것 입니다.\n");
	printf("제가 잘하는 게임으론 3시즌 연속 다이아를 찍은 롤토체스.\n");
	printf("제가 600시간 정도 플레이한 소울류를 잘합니다.\n");
	printf("제 장점으로는 참을성이 높고 외부에서 스트레스를 잘 안받으며 한번 시작한 일은 끝까지 하는 성격입니다.\n");
	printf("제 단점으로는 아직 프로그래밍 실력이 부족한 점과 소심한 성격이 단점입니다.\n");
	printf("---------------------------------------------------------------------------------------------\n");

}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
